
&НаКлиентеПроцедура ДобавитьФайлыДокумента(Команда)      	АдресВХранилище = "";	ВыбранноеИмяФайла = "";	Если ПоместитьФайл(АдресВХранилище, , ВыбранноеИмяФайла, Истина, УникальныйИдентификатор) Тогда		Файл = Новый Файл(ВыбранноеИмяФайла);		Имя = Файл.Имя;		СсылкаНаФайлВоВременномХранилище = АдресВХранилище;		//Объект.Наименование = Файл.Имя;		Модифицированность = Истина; 		//Объект.ИмяФайла = Имя;	КонецЕсли;                КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЭтоАдресВременногоХранилища(СсылкаНаФайлВоВременномХранилище) Тогда		ДвоичныеДанные = ПолучитьИзВременногоХранилища(СсылкаНаФайлВоВременномХранилище);		ТекущийОбъект.ФайлДокумента = Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных(9));		Файл = ПолучитьИмяВременногоФайла();		ДвоичныеДанные.Записать(Файл);  		Текст = Новый ТекстовыйДокумент;		Текст.Прочитать(Файл, ,);		ТекущийОбъект.СодержимоеДокумента = Текст.ПолучитьТекст();   		УдалитьФайлы(Файл);		КонецЕсли;  
	КонецПроцедуры 

&НаСервере
	Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
		Если ЭтоАдресВременногоХранилища(СсылкаНаФайлВоВременномХранилище) Тогда		УдалитьИзВременногоХранилища(СсылкаНаФайлВоВременномХранилище);	КонецЕсли;
	КонецПроцедуры
	
	

