
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТекущиеДанныеТовары  = Элементы.Товары.ТекущиеДанные;
    ТекущиеДанныеТовары.Сумма = ТекущиеДанныеТовары.Количество * ТекущиеДанныеТовары.Цена;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ТекущиеДанныеТовары  = Элементы.Товары.ТекущиеДанные;
    ТекущиеДанныеТовары.Сумма = ТекущиеДанныеТовары.Количество * ТекущиеДанныеТовары.Цена;
КонецПроцедуры

&НаСервере
Функция ТоварыТоварПриИзмененииНаСервере(Знач Номенклатура)

	Цена = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, Номенклатура = &Номенклатура) КАК ЦеныНоменклатурыСрезПоследних";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	Цена = ВыборкаДетальныеЗаписи.Цена;
	Возврат Цена;
	
КонецФункции

&НаКлиенте
Процедура ТоварыТоварПриИзменении(Элемент)
	ТД = Элементы.Товары.ТекущиеДанные;
	ТД.Цена = ТоварыТоварПриИзмененииНаСервере(ТД.Товар);
КонецПроцедуры
