
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		Предмет = ДанныеЗаполнения.Ссылка;
	КонецЕсли;   
	Автор = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры

Процедура ЗаказатьПоставщикуПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) 
	ФормируемыеЗадачи[0].Пользователь = Автор;

КонецПроцедуры

Процедура СогласоватьЗакупкуПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	ФормируемыеЗадачи[0].Подразделения = Справочники.Подразделения.Бухгалтерия;
КонецПроцедуры

Процедура ТребуетсяСогласованиеПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	УстановитьПривилегированныйРежим(Истина);
	Результат = Предмет.Сумма > Константы.СуммаПриобретенияТребующаяСогласования.Получить(); 
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

Процедура СогласоватьЗакупкуПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	Результат = Задача.Результат;      
	ЭтотОбъект.Записать();
КонецПроцедуры
